const data1 = [
    {
        "id": "country",
        "name": "Страна",
        "item": [
            {
                "id": 1,
                "name": "Россия"
            },
            {
                "id": 2,
                "name": "Кыргызстан"
            },
            {
                "id": 3,
                "name": "Казахстан"
            },
            {
                "id": 4,
                "name": "Таджикистан"
            },
            {
                "id": 5,
                "name": "Туркменистан"
            }
        ]
    },
    {
        "id": "region",
        "name": "Регион",
        "item": [
            {
                "id": 1,
                "name": "г.Москва"
            },
            {
                "id": 2,
                "name": "Амурскаяобласть(Благовещенск)"
            },
            {
                "id": 3,
                "name": "Архангельскаяобласть(Архангельск)"
            },
            {
                "id": 4,
                "name": "Астраханскаяобласть(Астрахань)"
            },
            {
                "id": 5,
                "name": "Белгородскаяобласть(Белгород)"
            },
            {
                "id": 6,
                "name": "Брянскаяобласть(Брянск)"
            },
            {
                "id": 7,
                "name": "Челябинскаяобласть(Челябинск)"
            },
            {
                "id": 8,
                "name": "Иркутскаяобласть(Иркутск)"
            },
            {
                "id": 9,
                "name": "Ивановскаяобласть(Иваново)"
            },
            {
                "id": 10,
                "name": "Калининградскаяобласть(Калининград)"
            },
            {
                "id": 11,
                "name": "Калужскаяобласть(Калуга)"
            },
            {
                "id": 12,
                "name": "Кемеровскаяобласть—Кузбасс(Кемерово)"
            },
            {
                "id": 13,
                "name": "Кировскаяобласть(Киров)"
            },
            {
                "id": 14,
                "name": "Костромскаяобласть(Кострома)"
            },
            {
                "id": 15,
                "name": "Курганскаяобласть(Курган)"
            },
            {
                "id": 16,
                "name": "Курскаяобласть(Курск)"
            },
            {
                "id": 17,
                "name": "Ленинградскаяобласть(Санкт Петербург)"
            },
            {
                "id": 19,
                "name": "Липецкаяобласть(Липецк)"
            },
            {
                "id": 20,
                "name": "Магаданскаяобласть(Магадан)"
            },
            {
                "id": 21,
                "name": "Московскаяобласть(Москва)"
            },
            {
                "id": 22,
                "name": "Мурманскаяобласть(Мурманск)"
            },
            {
                "id": 23,
                "name": "Нижегородскаяобласть(НижнийНовгород)"
            },
            {
                "id": 24,
                "name": "Новгородскаяобласть(ВеликийНовгород)"
            },
            {
                "id": 25,
                "name": "Новосибирскаяобласть(Новосибирск)"
            },
            {
                "id": 26,
                "name": "Омскаяобласть(Омск)"
            },
            {
                "id": 27,
                "name": "Оренбургскаяобласть(Оренбург)"
            },
            {
                "id": 28,
                "name": "Орловскаяобласть(Орёл)"
            },
            {
                "id": 29,
                "name": "Пензенскаяобласть(Пенза)"
            },
            {
                "id": 30,
                "name": "Псковскаяобласть(Псков)"
            },
            {
                "id": 31,
                "name": "Ростовскаяобласть(Ростов на Дону)"
            },
            {
                "id": 32,
                "name": "Рязанскаяобласть(Рязань)"
            },
            {
                "id": 33,
                "name": "Сахалинскаяобласть(Южно Сахалинск)"
            },
            {
                "id": 34,
                "name": "Самарскаяобласть(Самара)"
            },
            {
                "id": 35,
                "name": "Саратовскаяобласть(Саратов)"
            },
            {
                "id": 36,
                "name": "Смоленскаяобласть(Смоленск)"
            },
            {
                "id": 37,
                "name": "Свердловскаяобласть(Екатеринбург)"
            },
            {
                "id": 38,
                "name": "Тамбовскаяобласть(Тамбов)"
            },
            {
                "id": 39,
                "name": "Томскаяобласть(Томск)"
            },
            {
                "id": 40,
                "name": "Тверскаяобласть(Тверь)"
            },
            {
                "id": 41,
                "name": "Тульскаяобласть(Тула)"
            },
            {
                "id": 42,
                "name": "Тюменскаяобласть(Тюмень)"
            },
            {
                "id": 43,
                "name": "Ульяновскаяобласть(Ульяновск)"
            },
            {
                "id": 44,
                "name": "Владимирскаяобласть(Владимир)"
            },
            {
                "id": 45,
                "name": "Волгоградскаяобласть(Волгоград)"
            },
            {
                "id": 46,
                "name": "Вологодскаяобласть(Вологда)"
            },
            {
                "id": 47,
                "name": "Воронежскаяобласть(Воронеж)"
            },
            {
                "id": 48,
                "name": "Ярославскаяобласть(Ярославль)"
            },
            {
                "id": 49,
                "name": "г. Бишкек"
            },
            {
                "id": 50,
                "name": "г. Ош"
            },
            {
                "id": 51,
                "name": "Баткенская область"
            },
            {
                "id": 52,
                "name": "Джалал-Абадская область"
            },
            {
                "id": 53,
                "name": "Иссык-Кульская область"
            },
            {
                "id": 54,
                "name": "Нарынская область"
            },
            {
                "id": 55,
                "name": "Ошская область"
            },
            {
                "id": 56,
                "name": "Таласская область"
            },
            {
                "id": 57,
                "name": "Чуйская область"
            },
            {
                "id": 58,
                "name": "Нур-Султан (Астана)"
            },
            {
                "id": 59,
                "name": "Алматы"
            },
            {
                "id": 60,
                "name": "Шымкент"
            },
            {
                "id": 61,
                "name": "Байконыр"
            },
            {
                "id": 62,
                "name": "Акмолинская область"
            },
            {
                "id": 63,
                "name": "Актюбинская область"
            },
            {
                "id": 64,
                "name": "Алматинская область"
            },
            {
                "id": 65,
                "name": "Атырауская область"
            },
            {
                "id": 66,
                "name": "Восточно-Казахстанская область"
            },
            {
                "id": 67,
                "name": "Жамбылская область"
            },
            {
                "id": 68,
                "name": "Западно-Казахстанская область"
            },
            {
                "id": 69,
                "name": "Карагандинская область"
            },
            {
                "id": 70,
                "name": "Костанайская область"
            },
            {
                "id": 71,
                "name": "Кызылординская область"
            },
            {
                "id": 72,
                "name": "Мангистауская область"
            },
            {
                "id": 73,
                "name": "Павлодарская область"
            },
            {
                "id": 74,
                "name": "Севрено-Казахстанская область"
            },
            {
                "id": 75,
                "name": "Туркестанская область"
            },
            {
                "id": 76,
                "name": "г. Душанбе"
            },
            {
                "id": 77,
                "name": "Горно - Бажахшанская область"
            },
            {
                "id": 78,
                "name": "Согдийская область"
            },
            {
                "id": 79,
                "name": "Хатлонская область"
            },
            {
                "id": 80,
                "name": "Районы республиканского подчинения"
            },
            {
                "id": 81,
                "name": "г. Ашхабад"
            },
            {
                "id": 82,
                "name": "Ахалский велаят"
            },
            {
                "id": 83,
                "name": "Балканский велаят"
            },
            {
                "id": 84,
                "name": "Дашогузский велаят"
            },
            {
                "id": 85,
                "name": "Лебапский велаят"
            },
            {
                "id": 86,
                "name": "Марыйский велаят"
            }
        ]
    },
    {
        "id": "victim",
        "name": "В отношении кого совершено нарушение",
        "item": [
            {
                "id": 1,
                "name": "Физическое лицо"
            },
            {
                "id": 2,
                "name": "Группа лиц (работников)"
            }
        ]
    },
    {
        "id": "banonentry",
        "name": "Есть ли у вас запрет на въезд?",
        "item": [
            {
                "id": 1,
                "name": "Да"
            },
            {
                "id": 2,
                "name": "Нет"
            },
            {
                "id": 3,
                "name": "нет информации"
            },
            {
                "id": 4,
                "name": "другое"
            }
        ]
    },
    {
        "id": "infosource",
        "name": "Источник информации о нарушении",
        "item": [
            {
                "id": 1,
                "name": "Интервью с пострадавшим"
            },
            {
                "id": 2,
                "name": "Сообщение из СМИ"
            },
            {
                "id": 3,
                "name": "Информация от работодателя"
            },
            {
                "id": 4,
                "name": "Информация от юриста"
            },
            {
                "id": 5,
                "name": "Информация от НКО, правозащитной организации"
            },
            {
                "id": 6,
                "name": "Информация от правоохранительных органов"
            },
            {
                "id": 7,
                "name": "Информация от государственных органов"
            },
            {
                "id": 8,
                "name": "Информация от посольства/консульства"
            }
        ]
    },
    {
        "id": "right",
        "name": "Какое право нарушено?",
        "item": [
            {
                "id": 1,
                "name": "Оплата труда"
            },
            {
                "id": 2,
                "name": "Время отдыха (нет выходных дней и отпусков)"
            },
            {
                "id": 3,
                "name": "Доступ к социальному обеспечению и медицинскому обслуживанию"
            },
            {
                "id": 4,
                "name": "Безопасность условий труда на работе"
            },
            {
                "id": 5,
                "name": "Использование детского труда"
            },
            {
                "id": 6,
                "name": "Использование принудительного труда (забрали паспорт, не выплачивали заработную плату, угрожали, шантажировали, проявляли физическое/психологическое насилие т.п.)"
            },
            {
                "id": 7,
                "name": "Дискриминация в различных сферах трудовой деятельности"
            },
            {
                "id": 8,
                "name": "Эксплуатация (трудовая)"
            },
            {
                "id": 9,
                "name": "Доступ к гарантиям сохранения занятости"
            },
            {
                "id": 10,
                "name": "Ограничение доступа к членству в профсоюзе"
            },
            {
                "id": 11,
                "name": "Проведение консультации по трудовому законодательству"
            },
            {
                "id": 12,
                "name": "Право на справедливое судебное разбирательство"
            },
            {
                "id": 13,
                "name": "Сексуальные домогательства"
            },
            {
                "id": 14,
                "name": "другое "
            }
        ]
    },
    {
        "id": "individualinfo",
        "name": "физическое лицо",
        "item": []
    },
    {
        "id": "entrepreneur",
        "name": "Работодатель(Частное лицо)",
        "item": []
    },
    {
        "id": "intruder",
        "name": "Кем было совершено нарушение",
        "item": [
            {
                "id": 1,
                "name": "Государственные органы"
            },
            {
                "id": 2,
                "name": "Органы местного самоуправления"
            },
            {
                "id": 3,
                "name": "Правоохранительные органы"
            },
            {
                "id": 4,
                "name": "Органы, контролирующие мигрантов"
            },
            {
                "id": 5,
                "name": "Работодатель (компания)"
            },
            {
                "id": 6,
                "name": "Работодатель (частное лицо)"
            }
        ]
    },
    {
        "id": "natureviolation",
        "name": "Характер нарушения",
        "item": [
            {
                "id": 1,
                "name": "Разовое"
            },
            {
                "id": 2,
                "name": "Системное"
            }
        ]
    },
    {
        "id": "rightsstate",
        "name": "Ситуация с правами",
        "item": [
            {
                "id": 1,
                "name": "Права восстановлены"
            },
            {
                "id": 2,
                "name": "Права не восстановлены"
            },
            {
                "id": 3,
                "name": "Права восстановлены частично"
            },
            {
                "id": 4,
                "name": "Другое "
            }
        ]
    },
    {
        "id": "victimsituation",
        "name": "Ситуация с потерпевшим(и)",
        "item": [
            {
                "id": 1,
                "name": "Продолжает (ют) работать"
            },
            {
                "id": 2,
                "name": "Уволен(ы) под давлением работодателя"
            },
            {
                "id": 3,
                "name": "Прекратил(и) работать добровольно"
            },
            {
                "id": 4,
                "name": "Другое"
            }
        ]
    },
    {
        "id": "tradeunionsituation",
        "name": "Профсоюз на месте работы после произошедшего",
        "item": [
            {
                "id": 1,
                "name": "Продолжает действовать"
            },
            {
                "id": 2,
                "name": "Продолжает существовать, но не действует"
            },
            {
                "id": 3,
                "name": "Прекратил существование"
            },
            {
                "id": 4,
                "name": "Другое"
            }
        ]
    },
    {
        "id": "violationtype",
        "name": "С какими нарушениями трудовых прав вы столкнулись из-за COVID-19?",
        "item": [
            {
                "id": 1,
                "name": "Оплата труда стала меньше"
            },
            {
                "id": 2,
                "name": "Время работы увеличилось без оплаты"
            },
            {
                "id": 3,
                "name": "Не выдавали средства индивидуальной защиты"
            },
            {
                "id": 4,
                "name": "Не соблюдались санитарные нормы по обработке помещения"
            },
            {
                "id": 5,
                "name": "Отправили в отпуск без сохранения заработной платы"
            },
            {
                "id": 6,
                "name": "Уволили с работы в связи с пандемией"
            },
            {
                "id": 7,
                "name": "другое"
            }
        ]
    },
    {
        "id": "changesinsalary",
        "name": "Как изменились Ваши доходы из-за COVID-19?",
        "item": [
            {
                "id": 1,
                "name": "Сократился доход, остался только оклад, без премий и надбавок"
            },
            {
                "id": 2,
                "name": "Получаю столько же, сколько и раньше"
            },
            {
                "id": 3,
                "name": "Увеличился доход"
            },
            {
                "id": 4,
                "name": "уменьшился во время карантина, но сейчас снова увеличился"
            },
            {
                "id": 5,
                "name": "Другое"
            }
        ]
    },
    {
        "id": "user",
        "name": "Монитор",
        "item": [
            {
                "id": 1,
                "username": "admin"
            },
            {
                "id": 2,
                "username": "test"
            }
        ]
    }
];

const data2  = [
    {
        "country": "Казахстан",
        "region": "Севрено-Казахстанская область",
        "count": 1,
        "percent": 16.67
    },
    {
        "country": "Кыргызстан",
        "region": "г. Ош",
        "count": 5,
        "percent": 83.33
    }
]

let searchBtn = document.querySelector('#search-btn');

showRight(data1);
showResult(data2);

/** Событие и обработчик для кнопки найти
 *  Готовит данные для запроса
 * **/
searchBtn.onclick = function () {
    let sChecks = document.querySelectorAll('.s-checks:checked');
    let arr = [];

    sChecks.forEach(i => {
        let select = document.querySelector(`[data-id='${i.id}']`);
        let selected = [...select.selectedOptions].map(option => {return {id: option.value} });
        let obj = {id: i.id, item: selected};
        arr.push(obj);
    });

    getResult(arr);
}

/** Отправляет запрос для получение данных
 * @param {array} data - тело запроса
 * */
function getResult(data){
    console.log(data);
}

/** Показывает результат
 * @param {array} data - ответ от запроса
 * */
function showResult(data) {
    let td = '';
    let tr = '';
   data.forEach(item => {
       let keys = Object.keys(item);
       keys.forEach(i => {
           td += '<td>' + item[i] + '</td>';
       });

       tr += '<tr>' + td + '</td>';
       td = '';
   });

   document.querySelector('#left-result').innerHTML = tr;
}

/** Выводит список для поиска
 * @param {array} data - Данные для вывода
 * */
function showRight(data) {
    let block = '';
    data.forEach(item => {
        block += createRightElems(item.name, item.item, item.id);
    })

    document.querySelector('#right-result').innerHTML = block;

    let sChecks = document.querySelectorAll('.s-checks');

    sChecks.forEach(s => {
        s.onchange = showItems;
    })

}

/** Выводит блок для выпадающего списка
 * @param {object} e - Обьект event
 * */
function showItems(e) {
    let target = e.target.parentElement.parentElement.nextElementSibling;
    target.classList.toggle('d-none');
}

/** Создает выпадающий список
 * @param {string} name - Название выпад списка
 * @param {array} item - Список с данными
 * @param {string} id - Идентификатор
 * */
function createRightElems(name, item, id) {
    let itemElems = '';

    item.forEach(i => {
        itemElems += `<option value="${i.id}">${i.name}</option>`;
    })

    let block = '<div class="item">' +
                    '<div class="item-header">' +
                        '<label>' + name + ' <input class="s-checks" id="'+ id +'" type="checkbox"></label>' +
                    '</div>' +
                    '<div class="item-body d-none pt-3 pb-3">' +
                         '<select data-id="' + id + '" class="form-control s-selects" id="" multiple>'
                             + itemElems +
                         '</select>' +
                    '</div>' +
               '</div>';


    return block;

}

function getItems(e) {
    let value = e.target.value;

    console.log(value);
}